## Plan Result (826: deploy - PlanAndApply)




<pre><code>Plan: 6 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azuread_access_package.package[&#34;Redis Cache Contributor Access (Production)&#34;]
  * azuread_access_package_assignment_policy.this[&#34;self-approval:Redis Cache Contributor Access (Production)&#34;]
  * azuread_access_package_catalog.catalog[&#34;Redis Cache Access&#34;]
  * azuread_access_package_catalog_role_assignment.groups[&#34;Redis Cache Access&#34;]
  * azuread_access_package_resource_catalog_association.this[&#34;Redis Cache Access:DTS Redis Cache Contributors&#34;]
  * azuread_access_package_resource_package_association.this[&#34;Redis Cache Contributor Access (Production):Redis Cache Access:DTS Redis Cache Contributors&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # azuread_access_package.package["Redis Cache Contributor Access (Production)"] will be created
  + resource "azuread_access_package" "package" {
      + catalog_id   = (known after apply)
      + description  = "This will provide contributor access to Redis Cache resources in production environments and enable zone redundant features."
      + display_name = "Redis Cache Contributor Access (Production)"
      + hidden       = false
      + id           = (known after apply)
    }

  # azuread_access_package_assignment_policy.this["self-approval:Redis Cache Contributor Access (Production)"] will be created
  + resource "azuread_access_package_assignment_policy" "this" {
      + access_package_id = (known after apply)
      + description       = "Initial Policy"
      + display_name      = "Initial Policy"
      + duration_in_days  = 1
      + extension_enabled = true
      + id                = (known after apply)

      + approval_settings {
          + approval_required = false
        }

      + requestor_settings {
          + requests_accepted = true
          + scope_type        = "SpecificDirectorySubjects"

          + requestor {
              + object_id    = "db241a13-e1af-449e-a057-3322d10680bd"
              + subject_type = "groupMembers"
            }
          + requestor {
              + object_id    = "cfd53954-7782-4aae-b100-8108eb8f6094"
              + subject_type = "groupMembers"
            }
        }
    }

  # azuread_access_package_catalog.catalog["Redis Cache Access"] will be created
  + resource "azuread_access_package_catalog" "catalog" {
      + description        = "Redis Cache Resources Production Access"
      + display_name       = "Redis Cache Access"
      + externally_visible = false
      + id                 = (known after apply)
      + published          = true
    }

  # azuread_access_package_catalog_role_assignment.groups["Redis Cache Access"] will be created
  + resource "azuread_access_package_catalog_role_assignment" "groups" {
      + catalog_id          = (known after apply)
      + id                  = (known after apply)
      + principal_object_id = "e7ea2042-4ced-45dd-8ae3-e051c6551789"
      + role_id             = "ae79f266-94d4-4dab-b730-feca7e132178"
    }

  # azuread_access_package_resource_catalog_association.this["Redis Cache Access:DTS Redis Cache Contributors"] will be created
  + resource "azuread_access_package_resource_catalog_association" "this" {
      + catalog_id             = (known after apply)
      + id                     = (known after apply)
      + resource_origin_id     = "110e8b7c-ba81-43e0-977a-b3fb31b9191e"
      + resource_origin_system = "AadGroup"
    }

  # azuread_access_package_resource_package_association.this["Redis Cache Contributor Access (Production):Redis Cache Access:DTS Redis Cache Contributors"] will be created
  + resource "azuread_access_package_resource_package_association" "this" {
      + access_package_id               = (known after apply)
      + access_type                     = "Member"
      + catalog_resource_association_id = (known after apply)
      + id                              = (known after apply)
    }

Plan: 6 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":101,"Program":"tfcmt","SHA1":"","Target":"826: deploy - PlanAndApply","Vars":{}} -->